import numpy as np
import matplotlib.pyplot as plt
from scipy.spatial import Delaunay
import cv2

# 假设您已经有了一组人脸关键点，这里简单生成一组示例关键点
# 以二维平面为例，关键点以 (x, y) 的形式表示

img = cv2.imread('0_2.png',0)

keypoints = [[0, 59],
[ 0, 81],
[  2, 103],
[  4, 126],
[ 13, 151],
[ 29, 167],
[ 50, 182],
[ 76, 195],
[112, 201],
[145, 195],
[169, 181],
[189, 166],
[204, 148],
[212, 122],
[215, 100],
[217,  79],
[217,  58],
[16, 32],
[28, 21],
[47, 16],
[67, 17],
[85, 22],
[125,  22],
[143,  17],
[163,  17],
[182,  22],
[195,  32],
[106,  41],
[107,  53],
[107,  63],
[107,  75],
[86, 92],
[96, 94],
[108,  97],
[120,  94],
[130,  93],
[37, 50],
[48, 47],
[62, 46],
[76, 47],
[64, 49],
[49, 50],
[137,  48],
[150,  46],
[164,  47],
[176,  49],
[165,  50],
[150,  49],
[ 65, 136],
[ 78, 120],
[ 97, 112],
[109, 114],
[121, 112],
[140, 119],
[154, 136],
[141, 153],
[125, 160],
[110, 162],
[ 96, 161],
[ 79, 153],
[ 70, 136],
[ 96, 122],
[109, 121],
[122, 122],
[149, 136],
[124, 149],
[110, 150],
[ 96, 149]]


keypoints = np.array(keypoints)
# 进行Delaunay三角划分
tri = Delaunay(keypoints)

# 绘制Delaunay三角划分结果
plt.triplot(keypoints[:,0], keypoints[:,1], tri.simplices)
plt.plot(keypoints[:,0], keypoints[:,1], 'o')
plt.xlabel('X')
plt.ylabel('Y')
plt.title('Delaunay Triangulation on Face')
plt.gca().invert_yaxis()  # 翻转Y轴以匹配图像坐标系
plt.show()